Repository: YunisDEV/py-scripts
Catalog: docs/locales/*/LC_MESSAGES/api_reference.po
Languages: az

source: API Reference
az: API Referansı

source: Add new script
az: Yeni skript əlavə et

source: Options
az: Seçimlər

source: Name for new script
az: Yeni skript üçün ad

source: Command that script will used for
az: Skriptin istifadə ediləcəyi əmr

source: Description for new script (optional)
az: Yeni skript üçün təsvir (istəyə bağlı)

source: Special script that will execute "myp run build"
az: "myp run build" əmrini çalışdıran xüsusi skript

source: Special script that will execute "myp run deploy"
az: "myp run deploy" əmrini çalışdıran xüsusi skript

source: Build before deploy
az: Deploy prosesindən əvvəl build prosesini çalışdır

source: Output dependencies of project to requirements.txt
az: Asılılıqları requirements.txt faylına yaz

source: Get packages
az: Paketləri əldə et

source: Get packages as development dependency
az: Paketləri development asılılığı kimi əldə et

source: Get packages as production dependency
az: Paketləri production asılılığı kimi əldə et

source: Arguments
az: Arqumentlər

source: Required argument(s)
az: Tələb olunan arqument(lər)

source: Get packages in myp.json
az: myp.json faylındakı paketləri əldə et

source: Get dependencies in requirements file
az: Paketləri requirements faylından əldə et

source: Optional argument
az: İstəyə bağlı arqument

source: Initialize MYP in current folder
az: Hazırki qovluqda MYP-ni başlat

source: Name of template
az: Şablonun adı

source: Disable work of oninit event
az: oninit event-ini dayandır

source: Install dependencies in requirements.txt
az: requirements.txt faylındakı asılılıqları yüklə

source: Generate list of scripts as table
az: Skriptləri cədvəl kimi göstər

source: Remove script
az: Skripti sil

source: **Required** Name of script to remove
az: **Məcburi** Silinməli olan skriptin adı

source: Run MYP script with NAME
az: AD ilə MYP skriptini işlə sal

source: Required argument
az: Tələb olunan arqument

source: Set value of key in myp.json
az: myp.json faylının açarının dəyərini dəyişdir

source: Value to assing to key
az: Açara veriləcək dəyər

source: Show value of key in myp.json
az: Açarın myp.json faylındakı dəyərini göstər

source: Special script that will execute "myp run start"
az: "myp run start" əmrini çalışdıran xüsusi skript

source: Special script that will execute "myp run test"
az: "myp run test" əmrini çalışdıran xüsusi skript
