Repository: YunisDEV/py-scripts
Catalog: docs/locales/*/LC_MESSAGES/mypreader.po
Languages: az

source: MYPReader object
az: MYPReader obyekti

source: MYPReader is an instance to read data from `myp.json` file.
az: MYPReader `myp.json` faylındakı məlumatları oxumaq üçün obyektdir.

source: API Reference for `MYPReader`
az: `MYPReader` üçün API Referansı

source: Get data from object
az: Obyektdən məlumat əldə et

source: Set data to object
az: Obyektdəki məlumatı dəyişdir

source: Write object instance to `myp.json`
az: Obyekti `myp.json` faylına yazdır

source: Add script to object
az: Obyektə skript əlavə et

source: Remove script from object
az: Obyektdən skript sil

source: Add dependency to object
az: Obyektə asılılıq əlavə et

source: Get dependencies of object
az: Obyektdəki asılılıqları əldə et
